// 종로구 중심: 37.595829, 126.977207
// 서초구 중심: 37.476471, 127.031244
// 중구 중심: 37.561612, 126.995894

// 서울역 중심: 37.555236, 126.97074
export const INITIAL_CENTER = { lat: 37.555236, lng: 126.97074 }
export const INITIAL_CENTER_REGION = '중구'
export const INITIAL_ZOOM_LEVEL = 5

export interface CenterType {
  [key: string]: { lat: number; lng: number }
}
export const CENTER: CenterType = {
  강남구: { lat: 37.499962, lng: 127.063663 },
  강동구: { lat: 37.530894, lng: 127.123217 },
  강북구: { lat: 37.639425, lng: 127.025198 },
  강서구: { lat: 37.550243, lng: 126.849524 },
  관악구: { lat: 37.478204, lng: 126.95103 },
  광진구: { lat: 37.53859, lng: 127.082198 },
  구로구: { lat: 37.495888, lng: 126.884433 },
  금천구: { lat: 37.454315, lng: 126.900309 },
  노원구: { lat: 37.656356, lng: 127.055147 },
  도봉구: { lat: 37.668657, lng: 127.02999 },
  동대문구: { lat: 37.574238, lng: 127.04113 },
  동작구: { lat: 37.504185, lng: 126.973303 },
  마포구: { lat: 37.552945, lng: 126.918503 },
  서대문구: { lat: 37.57908, lng: 126.936881 },
  서초구: { lat: 37.483622, lng: 127.032167 },
  성동구: { lat: 37.56358, lng: 127.036042 },
  성북구: { lat: 37.610447, lng: 127.024612 }, // 데이터 없음
  송파구: { lat: 37.50451, lng: 127.105857 },
  양천구: { lat: 37.511121, lng: 126.866852 },
  영등포구: { lat: 37.525299, lng: 126.901005 },
  용산구: { lat: 37.5326, lng: 126.990206 },
  은평구: { lat: 37.609177, lng: 126.922838 },
  종로구: { lat: 37.57295, lng: 126.976974 },
  중구: { lat: 37.555236, lng: 126.97074 },
  중랑구: { lat: 37.606215, lng: 127.092748 },
}
